performance/FIpex/data/soap1.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2012 Oracle and/or its affiliates. All rights reserved.

    Oracle licenses this file to You under the Apache License, Version 2.0
    (the "License"); you may not use this file except in compliance with
    the License.  You may obtain a copy of the License at

         http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><ns3:echoMap xmlns:ns3="http://soapinterop.org/"><inputMap href="#id0"/></ns3:echoMap><multiRef id="id0" xsi:type="ns5:Map" xmlns:ns5="http://xml.apache.org/xml-soap"><item><key xsi:type="xsd:dateTime">2001-10-05T22:07:04.629Z</key><value xsi:type="xsd:string">string value</value></item><item><key xsi:type="xsd:string">stringKey</key><value xsi:type="xsd:int">5</value></item></multiRef></SOAP-ENV:Body></SOAP-ENV:Envelope>
